data/collected_data/grape/api/standarda2v2/d/load.txt
Running 60m test @ http://20.108.55.85:60
  2 threads and 1000 connections
  Thread calibration: mean lat.: 4490.068ms, rate sampling interval: 14712ms
  Thread calibration: mean lat.: 4511.122ms, rate sampling interval: 14680ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    22.73m    11.25m   43.94m    61.00%
    Req/Sec   291.36     55.47   402.00     77.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.82m 
 75.000%   32.00m 
 90.000%   37.78m 
 99.000%   43.94m 
 99.900%   46.70m 
 99.990%   48.76m 
 99.999%   49.56m 
100.000%   50.23m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3297.279     0.000000            1         1.00
  451674.111     0.100000       209700         1.11
  694681.599     0.200000       419197         1.25
  937426.943     0.300000       628943         1.43
 1157627.903     0.400000       838097         1.67
 1369440.255     0.500000      1047989         2.00
 1473249.279     0.550000      1152637         2.22
 1583349.759     0.600000      1257843         2.50
 1700790.271     0.650000      1362210         2.86
 1815085.055     0.700000      1467300         3.33
 1919942.655     0.750000      1572028         4.00
 1974468.607     0.775000      1624577         4.44
 2024800.255     0.800000      1676193         5.00
 2081423.359     0.825000      1728811         5.71
 2142240.767     0.850000      1781034         6.67
 2202009.599     0.875000      1833325         8.00
 2235564.031     0.887500      1861048         8.89
 2267021.311     0.900000      1886211        10.00
 2302672.895     0.912500      1912669        11.43
 2338324.479     0.925000      1938066        13.33
 2378170.367     0.937500      1965284        16.00
 2401239.039     0.943750      1978287        17.78
 2422210.559     0.950000      1990615        20.00
 2445279.231     0.956250      2003556        22.86
 2470445.055     0.962500      2016582        26.67
 2499805.183     0.968750      2030222        32.00
 2514485.247     0.971875      2036249        35.56
 2533359.615     0.975000      2043497        40.00
 2550136.831     0.978125      2049483        45.71
 2566914.047     0.981250      2056090        53.33
 2587885.567     0.984375      2062621        64.00
 2600468.479     0.985938      2066069        71.11
 2613051.391     0.987500      2069304        80.00
 2627731.455     0.989062      2072618        91.43
 2644508.671     0.990625      2075793       106.67
 2665480.191     0.992188      2078810       128.00
 2678063.103     0.992969      2080688       142.22
 2688548.863     0.993750      2082049       160.00
 2705326.079     0.994531      2083840       182.86
 2720006.143     0.995313      2085432       213.33
 2732589.055     0.996094      2087011       256.00
 2740977.663     0.996484      2087863       284.44
 2749366.271     0.996875      2088715       320.00
 2755657.727     0.997266      2089489       365.71
 2764046.335     0.997656      2090368       426.67
 2770337.791     0.998047      2091035       512.00
 2776629.247     0.998242      2091462       568.89
 2782920.703     0.998437      2092063       640.00
 2787115.007     0.998633      2092354       731.43
 2793406.463     0.998828      2092679       853.33
 2803892.223     0.999023      2093158      1024.00
 2810183.679     0.999121      2093295      1137.78
 2820669.439     0.999219      2093517      1280.00
 2826960.895     0.999316      2093692      1462.86
 2837446.655     0.999414      2093925      1706.67
 2847932.415     0.999512      2094107      2048.00
 2856321.023     0.999561      2094221      2275.56
 2862612.479     0.999609      2094328      2560.00
 2873098.239     0.999658      2094411      2925.71
 2885681.151     0.999707      2094554      3413.33
 2889875.455     0.999756      2094629      4096.00
 2894069.759     0.999780      2094676      4551.11
 2900361.215     0.999805      2094722      5120.00
 2908749.823     0.999829      2094780      5851.43
 2910846.975     0.999854      2094819      6826.67
 2917138.431     0.999878      2094870      8192.00
 2921332.735     0.999890      2094891      9102.22
 2925527.039     0.999902      2094923     10240.00
 2929721.343     0.999915      2094982     11702.86
 2929721.343     0.999927      2094982     13653.33
 2931818.495     0.999939      2095004     16384.00
 2933915.647     0.999945      2095015     18204.44
 2936012.799     0.999951      2095027     20480.00
 2938109.951     0.999957      2095050     23405.71
 2938109.951     0.999963      2095050     27306.67
 2942304.255     0.999969      2095065     32768.00
 2942304.255     0.999973      2095065     36408.89
 2944401.407     0.999976      2095070     40960.00
 2946498.559     0.999979      2095077     46811.43
 2948595.711     0.999982      2095091     54613.33
 2948595.711     0.999985      2095091     65536.00
 2950692.863     0.999986      2095095     72817.78
 2952790.015     0.999988      2095096     81920.00
 2956984.319     0.999989      2095099     93622.86
 2973761.535     0.999991      2095102    109226.67
 2982150.143     0.999992      2095108    131072.00
 2982150.143     0.999993      2095108    145635.56
 2984247.295     0.999994      2095111    163840.00
 2984247.295     0.999995      2095111    187245.71
 2994733.055     0.999995      2095112    218453.33
 3001024.511     0.999996      2095114    262144.00
 3001024.511     0.999997      2095114    291271.11
 3003121.663     0.999997      2095115    327680.00
 3005218.815     0.999997      2095116    374491.43
 3007315.967     0.999998      2095118    436906.67
 3007315.967     0.999998      2095118    524288.00
 3007315.967     0.999998      2095118    582542.22
 3007315.967     0.999998      2095118    655360.00
 3009413.119     0.999999      2095120    748982.86
 3009413.119     0.999999      2095120    873813.33
 3009413.119     0.999999      2095120   1048576.00
 3009413.119     0.999999      2095120   1165084.44
 3009413.119     0.999999      2095120   1310720.00
 3009413.119     0.999999      2095120   1497965.71
 3009413.119     0.999999      2095120   1747626.67
 3013607.423     1.000000      2095121   2097152.00
 3013607.423     1.000000      2095121          inf
#[Mean    =  1363991.168, StdDeviation   =   674776.677]
#[Max     =  3011510.272, Total count    =      2095121]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2097771 requests in 60.00m, 0.93GB read
  Socket errors: connect 0, read 94, write 590, timeout 34831
  Non-2xx or 3xx responses: 148858
Requests/sec:    582.71
Transfer/sec:    272.32KB